'use strict';

// создать 2 переменные (money и time), которые будут получать данные от пользователя:
// ·      Первая будет спрашивать "Ваш бюджет на месяц?"
// ·      Вторая "Введите дату в формате YYYY-MM-DD"
var money = prompt('Ваш бюджет на месяц?'),
    time = prompt('Введите дату в формате YYYY-MM-DD');

// Создать объект appData, который будет содержать такие данные
// ·      бюджет (передаем сюда переменную из п.2)
// ·      данные времени - timeData (передаем сюда переменную из п.2)
// ·      объект с обязательными расходами - expenses (смотри пункт 4)
// ·      объект с необязательными расходами - optionalExpenses (оставляем пока пустым)
// ·      массив данных с доп. доходом - income (оставляем пока пустым)
// ·      свойство savings (выставляем его как false)
var appData = {
    budget: money,
    timeData: time,
    expenses: {},
    optionalExpenses: {},
    income: [],
    savings: false
};

// Задать пользователю по 2 раза вопросы:
// “Введите обязательную статью расходов в этом месяце”
// “Во сколько обойдется?”
// Записать ответы в объект expenses в формате: 
// expenses: {
// “ответ на первый вопрос” : “ответ на второй вопрос”
// }
for (let i = 0; i < 2; i++) {
    let x = prompt('Введите обязательную статью расходов в этом месяце');
    let y = prompt('Во сколько обойдется?');
    appData.expenses[x] = y;
}

// Вывести на экран пользователя бюджет на 1 день (брать месяц за 30 дней, использовать console.log)
console.log(appData.money/30);
